<template>
	<view class="u-page">
		<u-read-more
		    ref="uReadMore"
		    :showHeight="showHeight"
			toggle
			@open="open"
			@close="close"
		>
			<u-parse
			    :content="content"
			    @load="load"
				:tag-style="tagStyle"
			></u-parse>
		</u-read-more>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				content: `
					<br/>
					<h4>91本地生活圈规则与免责声明</h4>
					<p>本平台采用智能识别系统，如违反以下规定，管理员将审核信息后要求用户更改。用户违反以下规定且不进行更改的，一切责任何由用户自行承担。</p>
					<p>违反以下规则，发布的信息将被管理人员删除，并对信息发布者进行禁言、禁止访问、删除等处理。对于违规及重复内容，平台管理员有权直接屏蔽显示并不退还任何信息发布费用！</p>
					<h4>一、违规规则</h4>
					<p><strong>1.法律法规明令禁止类：</strong>色情、反动，颠覆国家以及其它任何违背法律法规的信息；一切包含政治话题的信息；社会敏感度较高的话题的信息。</p>
					<p><strong>2.图片违规类：</strong>人体暴露照片及人体艺术图片；侮辱他人的图片；暴力、恐怖、血腥图片；引起人视觉反感的图片。</p>
					<p><strong>3.虚假信息：</strong>请保证您所发布信息的真实性，不得发布虚假信息，对此类信息造成的损失本站不负任何责任，您必须对所发布的信息负责，否则后果自负；本站在核实用户举报后将对信息和用户进行处理。</p>
					<p><strong>4.重复信息：</strong>同样内容或相似的信息，发布多次，霸屏、占屏等，影响平台用户浏览或者发布行为。</p>

					<h4>二、免责声明</h4>
					<p>1.平台信息发布为免费发布(除招聘和自助广告版块)，平台为用户提供相应的展示，信息推广和特定位置展示等价格以支付页面价格为准。平台发布的所有信息（免费、置顶信息）平台只负责发布、展示。</p>
					<p>2.平台里所有信息、资料，平台管理员有责任保证其准确性、完整性、有效性、时效性，但不一定能全部准确。请依据情况自行判断。私下通过本站私信或其他网络、电话等通讯工具，寻求捐助的行为，请大家自行进行判断，若因判断失误造成的损失责任自负。本站不负任何责任。</p>
					<p>3.本平台如因系统维护或升级而暂停服务时，将事先公告。若因线路及非本站控制范围内的硬件故障或其它不可抗力而导致暂停服务，于暂停服务期间造成的一切不便与损失，91本地生活圈不负任何责任。</p>
					<p>4.会员对自己的言论和行为负责，完全承担发表内容的责任，所持立场与91本地生活圈无关。平台使用者因为任何行为而触犯中华人民共和国法律或相关法规的，一切后果自己负责，平台不承担任何责任。凡以任何方式登录本站或直接、间接使用系统资料者，视为自愿接受本平台声明的约束。</p>

					<p>本声明未涉及的问题，请参见国家有关法律法规；当本声明与国家法律法规冲突时，以国家法律法规为准！</p>`,
				showHeight: 1500,
				tagStyle: {
					p: 'color: #606266; line-height: 24px;'
				}
			}
		},
		methods: {
			load() {
				this.$refs.uReadMore.init()
			},
			open(name) {
				console.log('open', name);
			},
			close(name) {
				console.log('close', name);
			}
		},
	}
</script>

<style lang="scss">

</style>
